import random

first_name = ['김','이','박','최', '정','전','강','심','오','소','고','선우','조',
              '신','임','편','위','제갈','장', '감','유','우','한','표','성','나','주',
              '배','송','홍','곽','독고','구','백','허']

last_name = ['호','정','순','결','빈','다','수','웅','민','재','훈','영','기','철','란',
             '성','경','표','석','우','용','배','서','진','종','균','태','인','자','윤',
             '옥','명','준','아','하','은','권','비','동','희','송','도','보','검','현',
             '흥','혜', '교','지', '남']

def get_rand_name() -> str:
    name = random.choice(first_name)
    name += random.choice(last_name)
    name += random.choice(last_name)
    return name